Revit 2026 API

# RevitAPIPostEventArgs Properties

---

The RevitAPIPostEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler). |

#### Reference

RevitAPIPostEventArgs Class

Autodesk.Revit.DB.Events Namespace